zlittell/MSF-XINPUT/MSF_XINPUT/Teensyduino Files that were edited/hardware/teensy/avr/boards.txt
menu.usb=USB Type
menu.speed=CPU Speed
menu.keys=Keyboard Layout


teensy36.name=Teensy 3.6
teensy36.upload.maximum_size=1048576
teensy36.upload.maximum_data_size=262144
teensy36.upload.tool=teensyloader
teensy36.upload.protocol=halfkay
teensy36.build.board=TEENSY36
teensy36.build.core=teensy3
teensy36.build.mcu=mk66fx1m0
teensy36.build.warn_data_percentage=99
teensy36.build.toolchain=arm/bin/
teensy36.build.command.gcc=arm-none-eabi-gcc
teensy36.build.command.g++=arm-none-eabi-g++
teensy36.build.command.ar=arm-none-eabi-ar
teensy36.build.command.objcopy=arm-none-eabi-objcopy
teensy36.build.command.objdump=arm-none-eabi-objdump
teensy36.build.command.size=arm-none-eabi-size
teensy36.build.flags.common=-g -Wall -ffunction-sections -fdata-sections -nostdlib
teensy36.build.flags.dep=-MMD
teensy36.build.flags.optimize=-Os
teensy36.build.flags.cpu=-mthumb -mcpu=cortex-m4 -mfloat-abi=hard -mfpu=fpv4-sp-d16 -fsingle-precision-constant
teensy36.build.flags.defs=-D__MK66FX1M0__ -DTEENSYDUINO=133
teensy36.build.flags.cpp=-fno-exceptions -felide-constructors -std=gnu++0x -fno-rtti
teensy36.build.flags.c=
teensy36.build.flags.S=-x assembler-with-cpp
teensy36.build.flags.ld=-Wl,--gc-sections,--relax,--defsym=__rtc_localtime={extra.time.local} "-T{build.core.path}/mk66fx1m0.ld"
teensy36.build.flags.libs=-larm_cortexM4lf_math -lm
teensy36.serial.restart_cmd=false

teensy36.menu.usb.serial=Serial
teensy36.menu.usb.serial.build.usbtype=USB_SERIAL
teensy36.menu.usb.keyboard=Keyboard
teensy36.menu.usb.keyboard.build.usbtype=USB_KEYBOARDONLY
teensy36.menu.usb.keyboard.fake_serial=teensy_gateway
teensy36.menu.usb.touch=Keyboard + Touch Screen
teensy36.menu.usb.touch.build.usbtype=USB_TOUCHSCREEN
teensy36.menu.usb.touch.fake_serial=teensy_gateway
teensy36.menu.usb.hidtouch=Keyboard + Mouse + Touch Screen
teensy36.menu.usb.hidtouch.build.usbtype=USB_HID_TOUCHSCREEN
teensy36.menu.usb.hidtouch.fake_serial=teensy_gateway
teensy36.menu.usb.hid=Keyboard + Mouse + Joystick
teensy36.menu.usb.hid.build.usbtype=USB_HID
teensy36.menu.usb.hid.fake_serial=teensy_gateway
teensy36.menu.usb.serialhid=Serial + Keyboard + Mouse + Joystick
teensy36.menu.usb.serialhid.build.usbtype=USB_SERIAL_HID
teensy36.menu.usb.midi=MIDI
teensy36.menu.usb.midi.build.usbtype=USB_MIDI
teensy36.menu.usb.midi.fake_serial=teensy_gateway
teensy36.menu.usb.serialmidi=Serial + MIDI
teensy36.menu.usb.serialmidi.build.usbtype=USB_MIDI_SERIAL
teensy36.menu.usb.audio=Audio
teensy36.menu.usb.audio.build.usbtype=USB_AUDIO
teensy36.menu.usb.audio.fake_serial=teensy_gateway
teensy36.menu.usb.serialmidiaudio=Serial + MIDI + Audio
teensy36.menu.usb.serialmidiaudio.build.usbtype=USB_MIDI_AUDIO_SERIAL
teensy36.menu.usb.rawhid=Raw HID
teensy36.menu.usb.rawhid.build.usbtype=USB_RAWHID
teensy36.menu.usb.rawhid.fake_serial=teensy_gateway
teensy36.menu.usb.flightsim=Flight Sim Controls
teensy36.menu.usb.flightsim.build.usbtype=USB_FLIGHTSIM
teensy36.menu.usb.flightsim.fake_serial=teensy_gateway
teensy36.menu.usb.flightsimjoystick=Flight Sim Controls + Joystick
teensy36.menu.usb.flightsimjoystick.build.usbtype=USB_FLIGHTSIM_JOYSTICK
teensy36.menu.usb.flightsimjoystick.fake_serial=teensy_gateway
teensy36.menu.usb.everything=All of the Above
teensy36.menu.usb.everything.build.usbtype=USB_EVERYTHING
teensy36.menu.usb.disable=No USB
teensy36.menu.usb.disable.build.usbtype=USB_DISABLED

teensy36.menu.speed.180opt=180 MHz
teensy36.menu.speed.168opt=168 MHz
teensy36.menu.speed.144opt=144 MHz
teensy36.menu.speed.120opt=120 MHz
teensy36.menu.speed.96opt=96 MHz
teensy36.menu.speed.72opt=72 MHz
teensy36.menu.speed.48opt=48 MHz
teensy36.menu.speed.24opt=24 MHz
teensy36.menu.speed.16opt=16 MHz (No USB)
teensy36.menu.speed.8opt=8 MHz (No USB)
teensy36.menu.speed.4opt=4 MHz (No USB)
teensy36.menu.speed.2opt=2 MHz (No USB)
teensy36.menu.speed.192opt=192 MHz (overclock)
teensy36.menu.speed.216opt=216 MHz (overclock)
teensy36.menu.speed.240opt=240 MHz (overclock)
teensy36.menu.speed.240opt.build.fcpu=240000000
teensy36.menu.speed.240opt.build.flags.optimize=-O
teensy36.menu.speed.240opt.build.flags.ldspecs=
teensy36.menu.speed.216opt.build.fcpu=216000000
teensy36.menu.speed.216opt.build.flags.optimize=-O
teensy36.menu.speed.216opt.build.flags.ldspecs=
teensy36.menu.speed.192opt.build.fcpu=192000000
teensy36.menu.speed.192opt.build.flags.optimize=-O
teensy36.menu.speed.192opt.build.flags.ldspecs=
teensy36.menu.speed.180opt.build.fcpu=180000000
teensy36.menu.speed.180opt.build.flags.optimize=-O
teensy36.menu.speed.180opt.build.flags.ldspecs=
teensy36.menu.speed.168opt.build.fcpu=168000000
teensy36.menu.speed.168opt.build.flags.optimize=-O
teensy36.menu.speed.168opt.build.flags.ldspecs=
teensy36.menu.speed.144opt.build.fcpu=144000000
teensy36.menu.speed.144opt.build.flags.optimize=-O
teensy36.menu.speed.144opt.build.flags.ldspecs=
teensy36.menu.speed.120opt.build.fcpu=120000000
teensy36.menu.speed.120opt.build.flags.optimize=-O
teensy36.menu.speed.120opt.build.flags.ldspecs=
teensy36.menu.speed.96opt.build.fcpu=96000000
teensy36.menu.speed.96opt.build.flags.optimize=-O
teensy36.menu.speed.96opt.build.flags.ldspecs=
teensy36.menu.speed.72opt.build.fcpu=72000000
teensy36.menu.speed.72opt.build.flags.optimize=-O
teensy36.menu.speed.72opt.build.flags.ldspecs=
teensy36.menu.speed.48opt.build.fcpu=48000000
teensy36.menu.speed.48opt.build.flags.optimize=-O
teensy36.menu.speed.48opt.build.flags.ldspecs=
teensy36.menu.speed.24opt.build.fcpu=24000000
teensy36.menu.speed.24opt.build.flags.optimize=-O
teensy36.menu.speed.24opt.build.flags.ldspecs=
teensy36.menu.speed.16opt.build.fcpu=16000000
teensy36.menu.speed.16opt.build.flags.optimize=-O
teensy36.menu.speed.16opt.build.flags.ldspecs=
teensy36.menu.speed.8opt.build.fcpu=8000000
teensy36.menu.speed.8opt.build.flags.optimize=-O
teensy36.menu.speed.8opt.build.flags.ldspecs=
teensy36.menu.speed.4opt.build.fcpu=4000000
teensy36.menu.speed.4opt.build.flags.optimize=-O
teensy36.menu.speed.4opt.build.flags.ldspecs=
teensy36.menu.speed.2opt.build.fcpu=2000000
teensy36.menu.speed.2opt.build.flags.optimize=-O
teensy36.menu.speed.2opt.build.flags.ldspecs=
teensy36.menu.speed.96.build.fcpu=96000000
teensy36.menu.speed.96.build.flags.optimize=-Os
teensy36.menu.speed.96.build.flags.ldspecs=--specs=nano.specs

teensy36.menu.keys.en-us=US English
teensy36.menu.keys.en-us.build.keylayout=US_ENGLISH
teensy36.menu.keys.fr-ca=Canadian French
teensy36.menu.keys.fr-ca.build.keylayout=CANADIAN_FRENCH
teensy36.menu.keys.xx-ca=Canadian Multilingual
teensy36.menu.keys.xx-ca.build.keylayout=CANADIAN_MULTILINGUAL
teensy36.menu.keys.cz-cz=Czech
teensy36.menu.keys.cz-cz.build.keylayout=CZECH
teensy36.menu.keys.da-da=Danish
teensy36.menu.keys.da-da.build.keylayout=DANISH
teensy36.menu.keys.fi-fi=Finnish
teensy36.menu.keys.fi-fi.build.keylayout=FINNISH
teensy36.menu.keys.fr-fr=French
teensy36.menu.keys.fr-fr.build.keylayout=FRENCH
teensy36.menu.keys.fr-be=French Belgian
teensy36.menu.keys.fr-be.build.keylayout=FRENCH_BELGIAN
teensy36.menu.keys.fr-ch=French Swiss
teensy36.menu.keys.fr-ch.build.keylayout=FRENCH_SWISS
teensy36.menu.keys.de-de=German
teensy36.menu.keys.de-de.build.keylayout=GERMAN
teensy36.menu.keys.de-dm=German (Mac)
teensy36.menu.keys.de-dm.build.keylayout=GERMAN_MAC
teensy36.menu.keys.de-ch=German Swiss
teensy36.menu.keys.de-ch.build.keylayout=GERMAN_SWISS
teensy36.menu.keys.is-is=Icelandic
teensy36.menu.keys.is-is.build.keylayout=ICELANDIC
teensy36.menu.keys.en-ie=Irish
teensy36.menu.keys.en-ie.build.keylayout=IRISH
teensy36.menu.keys.it-it=Italian
teensy36.menu.keys.it-it.build.keylayout=ITALIAN
teensy36.menu.keys.no-no=Norwegian
teensy36.menu.keys.no-no.build.keylayout=NORWEGIAN
teensy36.menu.keys.pt-pt=Portuguese
teensy36.menu.keys.pt-pt.build.keylayout=PORTUGUESE
teensy36.menu.keys.pt-br=Portuguese Brazilian
teensy36.menu.keys.pt-br.build.keylayout=PORTUGUESE_BRAZILIAN
teensy36.menu.keys.rs-rs=Serbian (Latin Only)
teensy36.menu.keys.rs-rs.build.keylayout=SERBIAN_LATIN_ONLY
teensy36.menu.keys.es-es=Spanish
teensy36.menu.keys.es-es.build.keylayout=SPANISH
teensy36.menu.keys.es-mx=Spanish Latin America
teensy36.menu.keys.es-mx.build.keylayout=SPANISH_LATIN_AMERICA
teensy36.menu.keys.sv-se=Swedish
teensy36.menu.keys.sv-se.build.keylayout=SWEDISH
teensy36.menu.keys.tr-tr=Turkish (partial)
teensy36.menu.keys.tr-tr.build.keylayout=TURKISH
teensy36.menu.keys.en-gb=United Kingdom
teensy36.menu.keys.en-gb.build.keylayout=UNITED_KINGDOM
teensy36.menu.keys.usint=US International
teensy36.menu.keys.usint.build.keylayout=US_INTERNATIONAL


