zlittell/MSF-XINPUT/MSF_XINPUT/Teensyduino Files that were edited/hardware/teensy/avr/boards.txt
teensy35.name=Teensy 3.5
teensy35.upload.maximum_size=524288
teensy35.upload.maximum_data_size=196608
teensy35.upload.tool=teensyloader
teensy35.upload.protocol=halfkay
teensy35.build.board=TEENSY35
teensy35.build.core=teensy3
teensy35.build.mcu=mk64fx512
teensy35.build.warn_data_percentage=98
teensy35.build.toolchain=arm/bin/
teensy35.build.command.gcc=arm-none-eabi-gcc
teensy35.build.command.g++=arm-none-eabi-g++
teensy35.build.command.ar=arm-none-eabi-ar
teensy35.build.command.objcopy=arm-none-eabi-objcopy
teensy35.build.command.objdump=arm-none-eabi-objdump
teensy35.build.command.size=arm-none-eabi-size
teensy35.build.flags.common=-g -Wall -ffunction-sections -fdata-sections -nostdlib
teensy35.build.flags.dep=-MMD
teensy35.build.flags.optimize=-Os
teensy35.build.flags.cpu=-mthumb -mcpu=cortex-m4 -mfloat-abi=hard -mfpu=fpv4-sp-d16 -fsingle-precision-constant
teensy35.build.flags.defs=-D__MK64FX512__ -DTEENSYDUINO=133
teensy35.build.flags.cpp=-fno-exceptions -felide-constructors -std=gnu++0x -fno-rtti
teensy35.build.flags.c=
teensy35.build.flags.S=-x assembler-with-cpp
teensy35.build.flags.ld=-Wl,--gc-sections,--relax,--defsym=__rtc_localtime={extra.time.local} "-T{build.core.path}/mk64fx512.ld"
teensy35.build.flags.libs=-larm_cortexM4lf_math -lm
teensy35.serial.restart_cmd=false

teensy35.menu.usb.serial=Serial
teensy35.menu.usb.serial.build.usbtype=USB_SERIAL
teensy35.menu.usb.keyboard=Keyboard
teensy35.menu.usb.keyboard.build.usbtype=USB_KEYBOARDONLY
teensy35.menu.usb.keyboard.fake_serial=teensy_gateway
teensy35.menu.usb.touch=Keyboard + Touch Screen
teensy35.menu.usb.touch.build.usbtype=USB_TOUCHSCREEN
teensy35.menu.usb.touch.fake_serial=teensy_gateway
teensy35.menu.usb.hidtouch=Keyboard + Mouse + Touch Screen
teensy35.menu.usb.hidtouch.build.usbtype=USB_HID_TOUCHSCREEN
teensy35.menu.usb.hidtouch.fake_serial=teensy_gateway
teensy35.menu.usb.hid=Keyboard + Mouse + Joystick
teensy35.menu.usb.hid.build.usbtype=USB_HID
teensy35.menu.usb.hid.fake_serial=teensy_gateway
teensy35.menu.usb.serialhid=Serial + Keyboard + Mouse + Joystick
teensy35.menu.usb.serialhid.build.usbtype=USB_SERIAL_HID
teensy35.menu.usb.midi=MIDI
teensy35.menu.usb.midi.build.usbtype=USB_MIDI
teensy35.menu.usb.midi.fake_serial=teensy_gateway
teensy35.menu.usb.serialmidi=Serial + MIDI
teensy35.menu.usb.serialmidi.build.usbtype=USB_MIDI_SERIAL
teensy35.menu.usb.audio=Audio
teensy35.menu.usb.audio.build.usbtype=USB_AUDIO
teensy35.menu.usb.audio.fake_serial=teensy_gateway
teensy35.menu.usb.serialmidiaudio=Serial + MIDI + Audio
teensy35.menu.usb.serialmidiaudio.build.usbtype=USB_MIDI_AUDIO_SERIAL
teensy35.menu.usb.rawhid=Raw HID
teensy35.menu.usb.rawhid.build.usbtype=USB_RAWHID
teensy35.menu.usb.rawhid.fake_serial=teensy_gateway
teensy35.menu.usb.flightsim=Flight Sim Controls
teensy35.menu.usb.flightsim.build.usbtype=USB_FLIGHTSIM
teensy35.menu.usb.flightsim.fake_serial=teensy_gateway
teensy35.menu.usb.flightsimjoystick=Flight Sim Controls + Joystick
teensy35.menu.usb.flightsimjoystick.build.usbtype=USB_FLIGHTSIM_JOYSTICK
teensy35.menu.usb.flightsimjoystick.fake_serial=teensy_gateway
teensy35.menu.usb.everything=All of the Above
teensy35.menu.usb.everything.build.usbtype=USB_EVERYTHING
teensy35.menu.usb.disable=No USB
teensy35.menu.usb.disable.build.usbtype=USB_DISABLED

teensy35.menu.speed.120opt=120 MHz
teensy35.menu.speed.96opt=96 MHz
teensy35.menu.speed.72opt=72 MHz
teensy35.menu.speed.48opt=48 MHz
teensy35.menu.speed.24opt=24 MHz
teensy35.menu.speed.16opt=16 MHz (No USB)
teensy35.menu.speed.8opt=8 MHz (No USB)
teensy35.menu.speed.4opt=4 MHz (No USB)
teensy35.menu.speed.2opt=2 MHz (No USB)
teensy35.menu.speed.192opt.build.fcpu=192000000
teensy35.menu.speed.192opt.build.flags.optimize=-O
teensy35.menu.speed.192opt.build.flags.ldspecs=
teensy35.menu.speed.180opt.build.fcpu=180000000
teensy35.menu.speed.180opt.build.flags.optimize=-O
teensy35.menu.speed.180opt.build.flags.ldspecs=
teensy35.menu.speed.168opt.build.fcpu=168000000
teensy35.menu.speed.168opt.build.flags.optimize=-O
teensy35.menu.speed.168opt.build.flags.ldspecs=
teensy35.menu.speed.144opt.build.fcpu=144000000
teensy35.menu.speed.144opt.build.flags.optimize=-O
teensy35.menu.speed.144opt.build.flags.ldspecs=
teensy35.menu.speed.120opt.build.fcpu=120000000
teensy35.menu.speed.120opt.build.flags.optimize=-O
teensy35.menu.speed.120opt.build.flags.ldspecs=
teensy35.menu.speed.96opt.build.fcpu=96000000
teensy35.menu.speed.96opt.build.flags.optimize=-O
teensy35.menu.speed.96opt.build.flags.ldspecs=
teensy35.menu.speed.72opt.build.fcpu=72000000
teensy35.menu.speed.72opt.build.flags.optimize=-O
teensy35.menu.speed.72opt.build.flags.ldspecs=
teensy35.menu.speed.48opt.build.fcpu=48000000
teensy35.menu.speed.48opt.build.flags.optimize=-O
teensy35.menu.speed.48opt.build.flags.ldspecs=
teensy35.menu.speed.24opt.build.fcpu=24000000
teensy35.menu.speed.24opt.build.flags.optimize=-O
teensy35.menu.speed.24opt.build.flags.ldspecs=
teensy35.menu.speed.16opt.build.fcpu=16000000
teensy35.menu.speed.16opt.build.flags.optimize=-O
teensy35.menu.speed.16opt.build.flags.ldspecs=
teensy35.menu.speed.8opt.build.fcpu=8000000
teensy35.menu.speed.8opt.build.flags.optimize=-O
teensy35.menu.speed.8opt.build.flags.ldspecs=
teensy35.menu.speed.4opt.build.fcpu=4000000
teensy35.menu.speed.4opt.build.flags.optimize=-O
teensy35.menu.speed.4opt.build.flags.ldspecs=
teensy35.menu.speed.2opt.build.fcpu=2000000
teensy35.menu.speed.2opt.build.flags.optimize=-O
teensy35.menu.speed.2opt.build.flags.ldspecs=
teensy35.menu.speed.96.build.fcpu=96000000
teensy35.menu.speed.96.build.flags.optimize=-Os
teensy35.menu.speed.96.build.flags.ldspecs=--specs=nano.specs

teensy35.menu.keys.en-us=US English
teensy35.menu.keys.en-us.build.keylayout=US_ENGLISH
teensy35.menu.keys.fr-ca=Canadian French
teensy35.menu.keys.fr-ca.build.keylayout=CANADIAN_FRENCH
teensy35.menu.keys.xx-ca=Canadian Multilingual
teensy35.menu.keys.xx-ca.build.keylayout=CANADIAN_MULTILINGUAL
teensy35.menu.keys.cz-cz=Czech
teensy35.menu.keys.cz-cz.build.keylayout=CZECH
teensy35.menu.keys.da-da=Danish
teensy35.menu.keys.da-da.build.keylayout=DANISH
teensy35.menu.keys.fi-fi=Finnish
teensy35.menu.keys.fi-fi.build.keylayout=FINNISH
teensy35.menu.keys.fr-fr=French
teensy35.menu.keys.fr-fr.build.keylayout=FRENCH
teensy35.menu.keys.fr-be=French Belgian
teensy35.menu.keys.fr-be.build.keylayout=FRENCH_BELGIAN
teensy35.menu.keys.fr-ch=French Swiss
teensy35.menu.keys.fr-ch.build.keylayout=FRENCH_SWISS
teensy35.menu.keys.de-de=German
teensy35.menu.keys.de-de.build.keylayout=GERMAN
teensy35.menu.keys.de-dm=German (Mac)
teensy35.menu.keys.de-dm.build.keylayout=GERMAN_MAC
teensy35.menu.keys.de-ch=German Swiss
teensy35.menu.keys.de-ch.build.keylayout=GERMAN_SWISS
teensy35.menu.keys.is-is=Icelandic
teensy35.menu.keys.is-is.build.keylayout=ICELANDIC
teensy35.menu.keys.en-ie=Irish
teensy35.menu.keys.en-ie.build.keylayout=IRISH
teensy35.menu.keys.it-it=Italian
teensy35.menu.keys.it-it.build.keylayout=ITALIAN
teensy35.menu.keys.no-no=Norwegian
teensy35.menu.keys.no-no.build.keylayout=NORWEGIAN
teensy35.menu.keys.pt-pt=Portuguese
teensy35.menu.keys.pt-pt.build.keylayout=PORTUGUESE
teensy35.menu.keys.pt-br=Portuguese Brazilian
teensy35.menu.keys.pt-br.build.keylayout=PORTUGUESE_BRAZILIAN
teensy35.menu.keys.rs-rs=Serbian (Latin Only)
teensy35.menu.keys.rs-rs.build.keylayout=SERBIAN_LATIN_ONLY
teensy35.menu.keys.es-es=Spanish
teensy35.menu.keys.es-es.build.keylayout=SPANISH
teensy35.menu.keys.es-mx=Spanish Latin America
teensy35.menu.keys.es-mx.build.keylayout=SPANISH_LATIN_AMERICA
teensy35.menu.keys.sv-se=Swedish
teensy35.menu.keys.sv-se.build.keylayout=SWEDISH
teensy35.menu.keys.tr-tr=Turkish (partial)
teensy35.menu.keys.tr-tr.build.keylayout=TURKISH
teensy35.menu.keys.en-gb=United Kingdom
teensy35.menu.keys.en-gb.build.keylayout=UNITED_KINGDOM
teensy35.menu.keys.usint=US International
teensy35.menu.keys.usint.build.keylayout=US_INTERNATIONAL


teensy31.name=Teensy 3.2 / 3.1
teensy31.upload.maximum_size=262144
teensy31.upload.maximum_data_size=65536
teensy31.upload.tool=teensyloader
teensy31.upload.protocol=halfkay
teensy31.build.board=TEENSY31
teensy31.build.core=teensy3
teensy31.build.mcu=mk20dx256
teensy31.build.warn_data_percentage=97
teensy31.build.toolchain=arm/bin/
teensy31.build.command.gcc=arm-none-eabi-gcc
teensy31.build.command.g++=arm-none-eabi-g++
teensy31.build.command.ar=arm-none-eabi-ar
teensy31.build.command.objcopy=arm-none-eabi-objcopy
teensy31.build.command.objdump=arm-none-eabi-objdump
teensy31.build.command.size=arm-none-eabi-size
teensy31.build.flags.common=-g -Wall -ffunction-sections -fdata-sections -nostdlib
teensy31.build.flags.dep=-MMD
teensy31.build.flags.optimize=-Os
teensy31.build.flags.cpu=-mthumb -mcpu=cortex-m4 -fsingle-precision-constant
teensy31.build.flags.defs=-D__MK20DX256__ -DTEENSYDUINO=133
teensy31.build.flags.cpp=-fno-exceptions -felide-constructors -std=gnu++0x -fno-rtti
teensy31.build.flags.c=
teensy31.build.flags.S=-x assembler-with-cpp
teensy31.build.flags.ld=-Wl,--gc-sections,--relax,--defsym=__rtc_localtime={extra.time.local} "-T{build.core.path}/mk20dx256.ld"
teensy31.build.flags.libs=-larm_cortexM4l_math -lm
teensy31.serial.restart_cmd=false
teensy31.menu.usb.serial=Serial
teensy31.menu.usb.serial.build.usbtype=USB_SERIAL
teensy31.menu.usb.keyboard=Keyboard
teensy31.menu.usb.keyboard.build.usbtype=USB_KEYBOARDONLY
teensy31.menu.usb.keyboard.fake_serial=teensy_gateway
teensy31.menu.usb.touch=Keyboard + Touch Screen
teensy31.menu.usb.touch.build.usbtype=USB_TOUCHSCREEN
teensy31.menu.usb.touch.fake_serial=teensy_gateway
teensy31.menu.usb.hidtouch=Keyboard + Mouse + Touch Screen
teensy31.menu.usb.hidtouch.build.usbtype=USB_HID_TOUCHSCREEN
teensy31.menu.usb.hidtouch.fake_serial=teensy_gateway
teensy31.menu.usb.hid=Keyboard + Mouse + Joystick
teensy31.menu.usb.hid.build.usbtype=USB_HID
teensy31.menu.usb.hid.fake_serial=teensy_gateway
teensy31.menu.usb.serialhid=Serial + Keyboard + Mouse + Joystick
teensy31.menu.usb.serialhid.build.usbtype=USB_SERIAL_HID
teensy31.menu.usb.midi=MIDI
teensy31.menu.usb.midi.build.usbtype=USB_MIDI
teensy31.menu.usb.midi.fake_serial=teensy_gateway
teensy31.menu.usb.serialmidi=Serial + MIDI
teensy31.menu.usb.serialmidi.build.usbtype=USB_MIDI_SERIAL
teensy31.menu.usb.audio=Audio
teensy31.menu.usb.audio.build.usbtype=USB_AUDIO
teensy31.menu.usb.audio.fake_serial=teensy_gateway
teensy31.menu.usb.serialmidiaudio=Serial + MIDI + Audio
teensy31.menu.usb.serialmidiaudio.build.usbtype=USB_MIDI_AUDIO_SERIAL
teensy31.menu.usb.rawhid=Raw HID
teensy31.menu.usb.rawhid.build.usbtype=USB_RAWHID
teensy31.menu.usb.rawhid.fake_serial=teensy_gateway
teensy31.menu.usb.flightsim=Flight Sim Controls
teensy31.menu.usb.flightsim.build.usbtype=USB_FLIGHTSIM
teensy31.menu.usb.flightsim.fake_serial=teensy_gateway
teensy31.menu.usb.flightsimjoystick=Flight Sim Controls + Joystick
teensy31.menu.usb.flightsimjoystick.build.usbtype=USB_FLIGHTSIM_JOYSTICK
teensy31.menu.usb.flightsimjoystick.fake_serial=teensy_gateway
teensy31.menu.usb.xinput=[MSF] XINPUT Controller
teensy31.menu.usb.xinput.build.usbtype=USB_XINPUT
teensy31.menu.usb.xinput.fake_serial=teensy_gateway
teensy31.menu.usb.everything=All of the Above
teensy31.menu.usb.everything.build.usbtype=USB_EVERYTHING
teensy31.menu.usb.disable=No USB
teensy31.menu.usb.disable.build.usbtype=USB_DISABLED
#uncomment these if you want to try faster overclocking
#teensy31.menu.speed.168opt=168 MHz optimize speed (overclock)
#teensy31.menu.speed.144opt=144 MHz optimize speed (overclock)
teensy31.menu.speed.96opt=96 MHz optimize speed (overclock)
teensy31.menu.speed.72opt=72 MHz optimize speed
teensy31.menu.speed.48opt=48 MHz optimize speed
teensy31.menu.speed.24opt=24 MHz optimize speed
teensy31.menu.speed.96=96 MHz reduce code size (overclock)
teensy31.menu.speed.72=72 MHz reduce code size
teensy31.menu.speed.48=48 MHz reduce code size
teensy31.menu.speed.24=24 MHz reduce code size
teensy31.menu.speed.16=16 MHz reduce code size (No USB)
teensy31.menu.speed.8=8 MHz reduce code size (No USB)
teensy31.menu.speed.4=4 MHz reduce code size (No USB)
teensy31.menu.speed.2=2 MHz reduce code size (No USB)
teensy31.menu.speed.120opt=120 MHz optimize speed (overclock)
teensy31.menu.speed.168opt.build.fcpu=168000000
teensy31.menu.speed.168opt.build.flags.optimize=-O
teensy31.menu.speed.168opt.build.flags.ldspecs=
teensy31.menu.speed.144opt.build.fcpu=144000000
teensy31.menu.speed.144opt.build.flags.optimize=-O
teensy31.menu.speed.144opt.build.flags.ldspecs=
teensy31.menu.speed.120opt.build.fcpu=120000000
teensy31.menu.speed.120opt.build.flags.optimize=-O
teensy31.menu.speed.120opt.build.flags.ldspecs=
teensy31.menu.speed.96opt.build.fcpu=96000000
teensy31.menu.speed.96opt.build.flags.optimize=-O
teensy31.menu.speed.96opt.build.flags.ldspecs=
teensy31.menu.speed.72opt.build.fcpu=72000000
teensy31.menu.speed.72opt.build.flags.optimize=-O
teensy31.menu.speed.72opt.build.flags.ldspecs=
teensy31.menu.speed.48opt.build.fcpu=48000000
teensy31.menu.speed.48opt.build.flags.optimize=-O
teensy31.menu.speed.48opt.build.flags.ldspecs=
teensy31.menu.speed.24opt.build.fcpu=24000000
teensy31.menu.speed.24opt.build.flags.optimize=-O
teensy31.menu.speed.24opt.build.flags.ldspecs=
teensy31.menu.speed.96.build.fcpu=96000000
teensy31.menu.speed.96.build.flags.optimize=-Os
teensy31.menu.speed.96.build.flags.ldspecs=--specs=nano.specs
teensy31.menu.speed.72.build.fcpu=72000000
teensy31.menu.speed.72.build.flags.optimize=-Os
teensy31.menu.speed.72.build.flags.ldspecs=--specs=nano.specs
teensy31.menu.speed.48.build.fcpu=48000000
teensy31.menu.speed.48.build.flags.optimize=-Os
teensy31.menu.speed.48.build.flags.ldspecs=--specs=nano.specs
teensy31.menu.speed.24.build.fcpu=24000000
teensy31.menu.speed.24.build.flags.optimize=-Os
teensy31.menu.speed.24.build.flags.ldspecs=--specs=nano.specs
teensy31.menu.speed.16.build.fcpu=16000000
teensy31.menu.speed.16.build.flags.optimize=-Os
teensy31.menu.speed.16.build.flags.ldspecs=--specs=nano.specs
teensy31.menu.speed.8.build.fcpu=8000000
teensy31.menu.speed.8.build.flags.optimize=-Os
teensy31.menu.speed.8.build.flags.ldspecs=--specs=nano.specs
teensy31.menu.speed.4.build.fcpu=4000000
teensy31.menu.speed.4.build.flags.optimize=-Os
teensy31.menu.speed.4.build.flags.ldspecs=--specs=nano.specs
teensy31.menu.speed.2.build.fcpu=2000000
teensy31.menu.speed.2.build.flags.optimize=-Os
teensy31.menu.speed.2.build.flags.ldspecs=--specs=nano.specs

